code-review/NRB_3471_3546/База_Было/InformationRegisters/СостоянияДокументовВФайловомШлюзе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СостоянияДокументовВФайловомШлюзе</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДокументовФайловыйШлюз</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пакет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИсходящийПакетВФайловыйШлюз</v8:Type>
						<v8:Type>cfg:DocumentRef.ВходящийПакетИзФайловогоШлюза</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоИсполнения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ТехническаяОперация</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/InformationRegisters/СтатусыПорученийВСЭД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СтатусыПорученийВСЭД</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДокументовВСЭД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Поручение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Enums/СтатусыДокументовФайловыйШлюз.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыДокументовФайловыйШлюз</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВыгрузитьФайловыйШлюз</Name>
					<Comment>Документ создан в системе "Депозитарий", необходимо выгрузить в файловый шлюз.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгруженоФайловыйШлюз</Name>
					<Comment>Документ не создан в системе "Депозитарий". Выгружены файлы в систему "Файловый шлюз".</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаФайловыйШлюз</Name>
					<Comment>Ошибка при попытке отправки, файлы перемещены в папку "ERRORS"</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгруженоВебКабинет</Name>
					<Comment>Поручение передано в веб-кабинет ДКУ, файлы перемещены в папку "SENT"</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятоКИсполнению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПринятоКИсполнению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исполнено</Name>
					<Comment>Поручение исполнено</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеИсполнено</Name>
					<Comment>Отказано в исполнении поручения</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполненоЧастично</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Enums/СтатусыПоручений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыПоручений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Обрабатывается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исполнено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказаноВИсполнении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполненоЧастично</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодтверждениеНалога</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Documents/ТехническаяОперация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ТехническаяОперация</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядковыйНомерВнутриДня</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомер</Name>
					<Comment>Регистрационный номер поручения/распоряжения</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационнаяДата</Name>
					<Comment>Дата и время регистрации поручения/распоряжения</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Комментарий1024</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОповеститьИнвестиционныйЦентр</Name>
					<Comment>Оповестить Инвестиционный центр</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокументаОснования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокументаОснования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОтчетаНРД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Documents/НеттоПоручение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>НеттоПоручение</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ИсполнениеПоручения</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСделки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Депонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Субклиенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКлиентаВнешнегоБрокера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОтчетаВышестоящегоДепозитария</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КомментарийНеограниченнойДлины</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХраненияКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПула</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланируемаяДатаРасчетов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделСчетаДепоКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделСчетаДепоМХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Референс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнойВвод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепоКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепоМХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Comment>Ценная бумага</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПоручения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыИнвентарныхПоручений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Поручения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Поручение</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/WebServices/FunctionalElectronicDocuments/Ext/Module.bsl
#Область CSDR

// Функция - Номер технической операции по поручению ДЕПО
//
// Параметры:
//  Поручение	 - 	 - Ссылка на документ Поручение базы ДЕПО
//  Номер		 - 	 - Номер документа ПоручениеДЕПО базы ИЦ
//  Дата		 - 	 - Дата документа ПоручениеДЕПО базы ИЦ
// 
// Возвращаемое значение: Номер (string) документа ТехническаяОперация
//   - 
//
Функция ДанныеТехническойОперацииПоПоручениюДЕПО(Поручение,Номер,Дата)
	// Учесть что нумерация Поручений ДЕПО в пределах года
	// 1.Если поле "ДокументОснование" пустое, поиск документа осуществлять по номеру основания из документа "Тех. операция" или по номеру самого документа "Тех. операция"
	// 2.Если поле "ДокументОснование" заполнено документом "Поручение", поиск документа осуществлять по номеру из реквизита "Входящий номер поручения" документа "Поручение"
	// 3.Если поле "ДокументОснование" заполнено "Нетто-поручение", поиск документа осуществлять по алгоритму: из основания берем документ "Нетто-поручение", 
	// 	из него берем все Поручения из табличной части, в каждом поручении берем "Входящий номер поручения"
	
	// Поручению может быть пустое - тогда по номеру основаня, иначе или Поручение = ДокументОснование или Поручение - в табличной части Нетто-поручения, которое = ДокументОснование
	
	Запрос = новый Запрос;
	Запрос.УстановитьПараметр("Поручение",Поручение);
	Запрос.УстановитьПараметр("Номер"    ,Номер);
	Запрос.УстановитьПараметр("Дата"     ,Дата);
	
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТехОперация.Ссылка КАК Документ,
	|	ТехОперация.РегистрационныйНомер КАК РегистрационныйНомер,
	|	ТехОперация.Номер КАК Номер
	|ПОМЕСТИТЬ втТехОперацияБезПоручения
	|ИЗ
	|	Документ.ТехническаяОперация КАК ТехОперация
	|ГДЕ
	|	&Поручение = ЗНАЧЕНИЕ(ДОКУМЕНТ.Поручение.ПустаяСсылка)
	|	И (ТехОперация.НомерДокументаОснования = &Номер
	|			ИЛИ ТехОперация.Номер = &Номер)
	|	И НАЧАЛОПЕРИОДА(ТехОперация.Дата, ГОД) = НАЧАЛОПЕРИОДА(&Дата, ГОД)
	|	И НЕ ТехОперация.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТехОперация.Дата УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТабЧастьПоручения.Ссылка КАК НеттоПоручение
	|ПОМЕСТИТЬ втНеттоПоручение
	|ИЗ
	|	Документ.НеттоПоручение.Поручения КАК ТабЧастьПоручения
	|ГДЕ
	|	НЕ &Поручение = ЗНАЧЕНИЕ(ДОКУМЕНТ.Поручение.ПустаяСсылка)
	|	И ТабЧастьПоручения.Поручение = &Поручение
	|	И НЕ ТабЧастьПоручения.Ссылка.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТехОперация.Ссылка КАК Документ,
	|	ТехОперация.РегистрационныйНомер КАК РегистрационныйНомер,
	|	ТехОперация.Номер КАК Номер
	|ПОМЕСТИТЬ втТехОперацияПоНетоПоручению
	|ИЗ
	|	Документ.ТехническаяОперация КАК ТехОперация
	|ГДЕ
	|	НЕ &Поручение = ЗНАЧЕНИЕ(ДОКУМЕНТ.Поручение.ПустаяСсылка)
	|	И НЕ ТехОперация.ПометкаУдаления
	|	И ВЫРАЗИТЬ(ТехОперация.ДокументОснование КАК Документ.НеттоПоручение) В
	|			(ВЫБРАТЬ
	|				втНеттоПоручение.НеттоПоручение
	|			ИЗ
	|				втНеттоПоручение КАК втНеттоПоручение)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТехОперация.Ссылка КАК Документ,
	|	ТехОперация.РегистрационныйНомер КАК РегистрационныйНомер,
	|	ТехОперация.Номер КАК Номер
	|ПОМЕСТИТЬ втТехОперацияПоПоручению
	|ИЗ
	|	Документ.ТехническаяОперация КАК ТехОперация
	|ГДЕ
	|	НЕ &Поручение = ЗНАЧЕНИЕ(ДОКУМЕНТ.Поручение.ПустаяСсылка)
	|	И (ВЫРАЗИТЬ(ТехОперация.ДокументОснование КАК Документ.Поручение)) = &Поручение
	|	И НЕ ТехОперация.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТехОперацияБезПоручения.Документ КАК Документ,
	|	втТехОперацияБезПоручения.РегистрационныйНомер КАК РегистрационныйНомер,
	|	втТехОперацияБезПоручения.Номер КАК Номер
	|ИЗ
	|	втТехОперацияБезПоручения КАК втТехОперацияБезПоручения
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	втТехОперацияПоНетоПоручению.Документ,
	|	втТехОперацияПоНетоПоручению.РегистрационныйНомер,
	|	втТехОперацияПоНетоПоручению.Номер
	|ИЗ
	|	втТехОперацияПоНетоПоручению КАК втТехОперацияПоНетоПоручению
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	втТехОперацияПоПоручению.Документ,
	|	втТехОперацияПоПоручению.РегистрационныйНомер,
	|	втТехОперацияПоПоручению.Номер
	|ИЗ
	|	втТехОперацияПоПоручению КАК втТехОперацияПоПоручению";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Результат = Новый Структура("Номер,РегистрационныйНомер","","");
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат,ВыборкаДетальныеЗаписи);
	КонецЕсли;
	
	AddNumberType = ФабрикаXDTO.Тип("http://www.vtbcapital-broker.com/depo/FunctionalElectronicDocuments",
		"AddNumberType");
	AddNumber	= ФабрикаXDTO.Создать(AddNumberType);
	AddNumber.number = Результат.Номер;
	AddNumber.reg_no = Результат.РегистрационныйНомер;
	
	Возврат AddNumber;
КонецФункции

// Функция - Get functional electronic documents nomer
//
// Параметры:
//  DocumentHeaderParam	 - 	 - Параметры документа(структура) ПоручениеДЕПО (из базы ИЦ): Номер(OrderId),Дата(OrderDate)
// 
// Возвращаемое значение: Номер (string) документа ТехническаяОперация
//   - 
//
Функция GetFunctionalElectronicDocumentsNumber(DocumentHeaderParam)
	
	СквознойИдентификаторВызова = DocumentHeaderParam.CallId;
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьФайловыйШлюзДляОтправкиПоручений") Тогда
		Возврат ОтветВебСервиса(СквознойИдентификаторВызова, -1,
			"Функциональная опция ""ИспользоватьФайловыйШлюзДляОтправкиПоручений"" выключена");
	КонецЕсли;
	
	ВремяНачалаWSGetFunctionalElectronicDocumentsNomer = ОценкаПроизводительности.НачатьЗамерВремени();

	Поручение = ПоручениеПоНомеруСделкиВБО(DocumentHeaderParam.OrderId, DocumentHeaderParam.OrderDate);
	
	ДанныеТехническойОперацииПоПоручениюДЕПО = ДанныеТехническойОперацииПоПоручениюДЕПО(Поручение,DocumentHeaderParam.OrderId, DocumentHeaderParam.OrderDate);
	
	ОценкаПроизводительности.ЗакончитьЗамерВремени("ВыполнениеWSGetFunctionalElectronicDocumentsNomer", ВремяНачалаWSGetFunctionalElectronicDocumentsNomer);
	
	Возврат ДанныеТехническойОперацииПоПоручениюДЕПО;

КонецФункции

#КонецОбласти

Функция SendFunctionalElectronicDocuments(SendFunctionalElectronicDocumentsRequest)
	//СквознойИдентификаторВызова = Строка(Новый УникальныйИдентификатор());
	
	//СообщениеОбмена = SendFunctionalElectronicDocumentsRequest;
	//
	//РегистрыСведений.СообщенияОбменаСоСмежнымиСистемами.ДобавитьЗапись(СквознойИдентификаторВызова, "FunctionalElectronicDocuments", "SendFunctionalElectronicDocuments", "Входящее", СообщениеОбмена);
	//
	//Для каждого Document Из SendFunctionalElectronicDocumentsRequest Цикл
	//	
	//КонецЦикла; 
	
	
	//AdditionalDocumentsStatusType = ФабрикаXDTO.Тип("http://www.vtbcapital-broker.com/depo/FunctionalElectronicDocuments", "AdditionalDocumentsStatusType");
	//AdditionalDocumentsStatus = ФабрикаXDTO.Создать(AdditionalDocumentsStatusType);
	
	//BaseStatus.StatusCode = 0;
	//BaseStatus.Description = "";
	//BaseStatus.CallId = "";
	
	//AdditionalDocumentsStatus.BaseStatus = BaseStatus;
	
	//Responce.BaseStatus = BaseStatus;
	//Responce.AdditionalDocumentsStatus = AdditionalDocumentsStatus;
	
	//Возврат Responce;
	Возврат Неопределено;
КонецФункции

Функция Send(SendFunctionalElectronicDocumentsRequest)
	СквознойИдентификаторВызова = SendFunctionalElectronicDocumentsRequest.FunctionalElectronicDocumentHeader.CallId;
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьФайловыйШлюзДляОтправкиПоручений") Тогда 
		Возврат ОтветВебСервиса(СквознойИдентификаторВызова, -1, "Функциональная опция ""ИспользоватьФайловыйШлюзДляОтправкиПоручений"" выключена");
	КонецЕсли;
	
	ТекстСообщения = XDTOСтрокой(SendFunctionalElectronicDocumentsRequest);
	
	РегистрыСведений.СообщенияОбменаСоСмежнымиСистемами.ДобавитьЗапись(СквознойИдентификаторВызова, "FunctionalElectronicDocuments", "SendFunctionalElectronicDocuments", "Входящее", ТекстСообщения);
	
	DocumentHeader  = SendFunctionalElectronicDocumentsRequest.FunctionalElectronicDocumentHeader;
	DocumentMessage = SendFunctionalElectronicDocumentsRequest.FunctionalElectronicDocumentMessage;
	OrderHeader = DocumentMessage.Order_Header;
	
	СтруктураДокумента = СформироватьСтруктуруДокумента(DocumentMessage, DocumentHeader);
	Если СтруктураДокумента.ТекстДокумента <> "" Тогда
		Ошибка = Обработки.ЭкспортПорученийВЛуч.СформироватьИсходящийПакетВФайловыйШлюз(DocumentHeader.OrderId, DocumentHeader.OrderDate, DocumentHeader.OrderType, OrderHeader.order_t_id, , СтруктураДокумента.ТекстДокумента);
		Если Ошибка = Неопределено Тогда
			Возврат ОтветВебСервиса(СквознойИдентификаторВызова, 0, "");
		Иначе
			Возврат ОтветВебСервиса(СквознойИдентификаторВызова, -1, Ошибка.СообщениеПользователю);
		КонецЕсли; 
	Иначе
		Возврат ОтветВебСервиса(СквознойИдентификаторВызова, -1, СтруктураДокумента.Ошибка);
	КонецЕсли; 
	
	Возврат ОтветВебСервиса(СквознойИдентификаторВызова, 0, "");
КонецФункции

Функция GetFunctionalElectronicDocumentsStatus(DocumentHeaderParam)
	
	СквознойИдентификаторВызова = DocumentHeaderParam.CallId;
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьФайловыйШлюзДляОтправкиПоручений") Тогда
		Возврат ОтветВебСервиса(СквознойИдентификаторВызова, -1,
			"Функциональная опция ""ИспользоватьФайловыйШлюзДляОтправкиПоручений"" выключена");
	КонецЕсли;
	
	ВремяНачалаWSGetFunctionalElectronicDocumentsStatus = ОценкаПроизводительности.НачатьЗамерВремени();
	
	RequestStatusType = ФабрикаXDTO.Тип("http://www.vtbcapital-broker.com/depo/FunctionalElectronicDocuments",
		"SendFunctionalElectronicDocumentsRequestStatusType");
	HeaderType = ФабрикаXDTO.Тип("http://www.vtbcapital-broker.com/depo/FunctionalElectronicDocuments",
		"FunctionalElectronicDocumentHeaderType");
	StatusMessageType = ФабрикаXDTO.Тип("http://www.vtbcapital-broker.com/depo/FunctionalElectronicDocuments",
		"FunctionalElectronicDocumentStatusMessageType");
		
	DistributedSeqAmountType = ФабрикаXDTO.Тип("http://www.vtbcapital-broker.com/depo/FunctionalElectronicDocuments",
		"DistributedSeqAmountType");
	
	RequestStatus	= ФабрикаXDTO.Создать(RequestStatusType);
	DocumentHeader	= ФабрикаXDTO.Создать(HeaderType);
	StatusMessage	= ФабрикаXDTO.Создать(StatusMessageType);
	
	Поручение = ПоручениеПоНомеруСделкиВБО(DocumentHeaderParam.OrderId, DocumentHeaderParam.OrderDate);
	Если ЗначениеЗаполнено(Поручение) Тогда
		РасчетыНаDMA = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Поручение, "РасчетыНаDMA");
		Если РасчетыНаDMA Тогда
			Данные = ДанныеИсполненийПоручений(Поручение);
		Иначе
			Данные = ДанныеСтатусовПоручений(Поручение);
		КонецЕсли;
	Иначе
		РасчетыНаDMA = Истина;
		Данные = ДанныеВходящихПакетов(DocumentHeaderParam.OrderId, DocumentHeaderParam.OrderDate);
	КонецЕсли;
	
	Выборка = Данные.ЗапросМаксимальноеКоличествоОтчета.Выбрать();
	Если Выборка.Следующий() Тогда
		МаксимальноеКоличествоОтчета = СтрокуВЧисло(Выборка.МаксимальноеКоличествоОтчета);
	Иначе
		МаксимальноеКоличествоОтчета = 0;
	КонецЕсли;
	
	Выборка = Данные.ЗапросВходящийРегНомер.Выбрать();
	Если Выборка.Следующий() Тогда
		StatusMessage.InRegNumber = Выборка.ВходящийРегНомер;
	КонецЕсли;
	
	Выборка = Данные.ЗапросРаспределенныеКоличества.Выбрать();
	Пока Выборка.Следующий() Цикл
		// Ограничение количества отчета НРД (актуально при избыточном количестве для клиентских сделок)
		КоличествоОтчета = СтрокуВЧисло(Выборка.КоличествоОтчета);
		КоличествоОтчета = Мин(КоличествоОтчета, МаксимальноеКоличествоОтчета);
		МаксимальноеКоличествоОтчета = МаксимальноеКоличествоОтчета - КоличествоОтчета;
		
		// Отбор возвращаемых строк по дате среза LastReportDate только для расчетов на DMA
		Если Не РасчетыНаDMA
			Или (Не ЗначениеЗаполнено(DocumentHeaderParam.LastReportDate)
					Или Выборка.ДатаПакета > DocumentHeaderParam.LastReportDate) Тогда
			
			СтрокаXDTO = ФабрикаXDTO.Создать(DistributedSeqAmountType);
			СтрокаXDTO.Status		= СтатусЧислом(Выборка.Статус);
			СтрокаXDTO.Description	= Выборка.Комментарий;
			СтрокаXDTO.reg_no		= Выборка.КодОтчетаВышестоящегоДепозитария;
			СтрокаXDTO.reg_date		= Выборка.ДатаИсполнения;
			СтрокаXDTO.PacketDate	= Выборка.ДатаПакета;
			СтрокаXDTO.ExecutedAmount	= ЧислоСтрокой(Выборка.ИсполненноеКоличество);
			СтрокаXDTO.ReportAmount		= ЧислоСтрокой(КоличествоОтчета);
			СтрокаXDTO.OperationReportNumber	= Выборка.НомерОтчетаОСовершеннойОперации;
			СтрокаXDTO.OperationReportDate		= Выборка.ДатаОтчетаОСовершеннойОперации;
			
			ОбработатьНеопределенныеЗначения(СтрокаXDTO);
			
			StatusMessage.DistributedSeqAmountRows.Добавить(СтрокаXDTO);
		КонецЕсли;
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(DocumentHeader, DocumentHeaderParam);
		
	RequestStatus.FunctionalElectronicDocumentHeader = DocumentHeader;
	RequestStatus.FunctionalElectronicDocumentStatusMessage = StatusMessage;
	
	ОценкаПроизводительности.ЗакончитьЗамерВремени("ВыполнениеWSGetFunctionalElectronicDocumentsStatus", ВремяНачалаWSGetFunctionalElectronicDocumentsStatus);
	
	Возврат RequestStatus;
	
КонецФункции

Функция ЧислоСтрокой(Данные)
	
	Если ТипЗнч(Данные) = Тип("Строка") Тогда
		Возврат СтрЗаменить(Данные, " ", "");		
	ИначеЕсли ТипЗнч(Данные) = Тип("Число") Тогда
		Возврат Формат(Данные, "ЧГ=0");
	Иначе
		Возврат "0";
	КонецЕсли;
	
КонецФункции

Функция СтрокуВЧисло(Знач Данные)
	
	Если ТипЗнч(Данные) = Тип("Число") Тогда
		Возврат Данные;
		
	ИначеЕсли ТипЗнч(Данные) = Тип("Строка") Тогда
		Данные = СтрЗаменить(Данные, " ", "");
		Если Данные = "" Тогда
			Данные = "0";
		КонецЕсли;
		Возврат Число(Данные);
		
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

Функция ПоручениеПоНомеруСделкиВБО(Номер, Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Поручение.Ссылка КАК Поручение
	|ИЗ
	|	Документ.Поручение КАК Поручение
	|ГДЕ
	|	Поручение.НомерПорученияВБО = &Номер
	|	И НАЧАЛОПЕРИОДА(Поручение.Дата, ГОД) = НАЧАЛОПЕРИОДА(&Дата, ГОД)
	|	И НЕ Поручение.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Поручение.Дата УБЫВ";
	Запрос.УстановитьПараметр("Номер",	Номер);
	Запрос.УстановитьПараметр("Дата",	Дата);
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Поручение;
		КонецЕсли;
	КонецЕсли;
	Возврат Документы.Поручение.ПустаяСсылка();
	
КонецФункции

Функция ДанныеИсполненийПоручений(Поручение)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТабЧастьПоручения.Ссылка КАК НеттоПоручение,
	|	ТабЧастьПоручения.Ссылка.Количество КАК Количество
	|ПОМЕСТИТЬ втНеттоПоручение
	|ИЗ
	|	Документ.НеттоПоручение.Поручения КАК ТабЧастьПоручения
	|ГДЕ
	|	ТабЧастьПоручения.Поручение = &Поручение
	|	И НЕ ТабЧастьПоручения.Ссылка.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втНеттоПоручение.Количество КАК МаксимальноеКоличествоОтчета
	|ИЗ
	|	втНеттоПоручение КАК втНеттоПоручение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТехОперация.Ссылка КАК Документ,
	|	ТехОперация.РегистрационныйНомер КАК РегистрационныйНомер
	|ПОМЕСТИТЬ втТехОперация
	|ИЗ
	|	Документ.ТехническаяОперация КАК ТехОперация
	|ГДЕ
	|	НЕ ТехОперация.ПометкаУдаления
	|	И ВЫРАЗИТЬ(ТехОперация.ДокументОснование КАК Документ.НеттоПоручение) В
	|			(ВЫБРАТЬ
	|				втНеттоПоручение.НеттоПоручение
	|			ИЗ
	|				втНеттоПоручение КАК втНеттоПоручение)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТехОперация.Дата УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТехОперация.РегистрационныйНомер КАК ВходящийРегНомер
	|ИЗ
	|	втТехОперация КАК втТехОперация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Состояния.Пакет.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
	|	Состояния.Пакет.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
	|	Состояния.Пакет.Дата КАК ДатаПакета
	|ПОМЕСТИТЬ втДатыПакетов
	|ИЗ
	|	РегистрСведений.СостоянияДокументовВФайловомШлюзе КАК Состояния
	|ГДЕ
	|	Состояния.Статус В(&СтатусыИсполненияВФайловомШлюзе)
	|	И Состояния.Документ В
	|			(ВЫБРАТЬ
	|				втТехОперация.Документ
	|			ИЗ
	|				втТехОперация КАК втТехОперация)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиЦБ.Статус КАК Статус,
	|	ОстаткиЦБ.Ссылка.Комментарий КАК Комментарий,
	|	ОстаткиЦБ.Ссылка.КодОтчетаВышестоящегоДепозитария КАК КодОтчетаВышестоящегоДепозитария,
	|	ОстаткиЦБ.Ссылка.Дата КАК ДатаИсполнения,
	|	ЕСТЬNULL(втДатыПакетов.ДатаПакета, ОстаткиЦБ.Ссылка.Дата) КАК ДатаПакета,
	|	ОстаткиЦБ.КоличествоОтчета КАК ИсполненноеКоличество,
	|	ОстаткиЦБ.Ссылка.Количество КАК КоличествоОтчета,
	|	Выписка.Номер КАК НомерОтчетаОСовершеннойОперации,
	|	Выписка.Дата КАК ДатаОтчетаОСовершеннойОперации
	|ПОМЕСТИТЬ втИсполнения
	|ИЗ
	|	Документ.ИсполнениеПоручения.ОстаткиЦБ КАК ОстаткиЦБ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Выписка КАК Выписка
	|		ПО (Выписка.ДокументОснование = &Поручение)
	|			И (Выписка.Проведен)
	|			И (ВЫРАЗИТЬ(Выписка.ОперацияЦБ КАК Документ.ОперацииЦБ).Дата = ОстаткиЦБ.Ссылка.Дата)
	|			И (ВЫРАЗИТЬ(Выписка.ОперацияЦБ КАК Документ.ОперацииЦБ).Количество = ОстаткиЦБ.КоличествоОтчета)
	|			И (ВЫРАЗИТЬ(Выписка.ОперацияЦБ КАК Документ.ОперацииЦБ).Проведен)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацияДокументовВЭДО КАК РегистрацияДокументовВЭДО
	|		ПО (РегистрацияДокументовВЭДО.Документ = Выписка.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втДатыПакетов КАК втДатыПакетов
	|		ПО (втДатыПакетов.НомерВходящегоДокумента = ОстаткиЦБ.Ссылка.КодОтчетаВышестоящегоДепозитария)
	|			И (втДатыПакетов.ДатаВходящегоДокумента = ОстаткиЦБ.Ссылка.Дата)
	|ГДЕ
	|	ОстаткиЦБ.Ссылка.Проведен
	|	И ОстаткиЦБ.Поручение = &Поручение
	|	И ОстаткиЦБ.Ссылка.ДокументОснование В
	|			(ВЫБРАТЬ
	|				втНеттоПоручение.НеттоПоручение
	|			ИЗ
	|				втНеттоПоручение КАК втНеттоПоручение)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Состояния.Статус КАК Статус,
	|	Состояния.Комментарий КАК Комментарий,
	|	Состояния.Документ.КодОтчетаНРД КАК КодОтчетаВышестоящегоДепозитария,
	|	Состояния.Документ.ДатаИсполнения КАК ДатаИсполнения,
	|	ЕСТЬNULL(Состояния.Пакет.Дата, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПакета
	|ПОМЕСТИТЬ втСостоянияФШ
	|ИЗ
	|	РегистрСведений.СостоянияДокументовВФайловомШлюзе.СрезПоследних(
	|			,
	|			Документ В
	|					(ВЫБРАТЬ
	|						втТехОперация.Документ
	|					ИЗ
	|						втТехОперация КАК втТехОперация)
	|				И НЕ Статус В (&СтатусыИсполненияВФайловомШлюзе)) КАК Состояния
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(втИсполнения.Статус, втСостоянияФШ.Статус) КАК Статус,
	|	ЕСТЬNULL(втИсполнения.Комментарий, втСостоянияФШ.Комментарий) КАК Комментарий,
	|	ЕСТЬNULL(втИсполнения.КодОтчетаВышестоящегоДепозитария, втСостоянияФШ.КодОтчетаВышестоящегоДепозитария) КАК КодОтчетаВышестоящегоДепозитария,
	|	ЕСТЬNULL(втИсполнения.ДатаИсполнения, втСостоянияФШ.ДатаИсполнения) КАК ДатаИсполнения,
	|	ЕСТЬNULL(втИсполнения.ДатаПакета, втСостоянияФШ.ДатаПакета) КАК ДатаПакета,
	|	ЕСТЬNULL(втИсполнения.ИсполненноеКоличество, 0) КАК ИсполненноеКоличество,
	|	ЕСТЬNULL(втИсполнения.КоличествоОтчета, 0) КАК КоличествоОтчета,
	|	ЕСТЬNULL(втИсполнения.НомерОтчетаОСовершеннойОперации, """") КАК НомерОтчетаОСовершеннойОперации,
	|	ЕСТЬNULL(втИсполнения.ДатаОтчетаОСовершеннойОперации, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаОтчетаОСовершеннойОперации
	|ИЗ
	|	втСостоянияФШ КАК втСостоянияФШ
	|		ПОЛНОЕ СОЕДИНЕНИЕ втИсполнения КАК втИсполнения
	|		ПО (ИСТИНА)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЕСТЬNULL(втИсполнения.ДатаИсполнения, втСостоянияФШ.ДатаИсполнения)";
	Запрос.УстановитьПараметр("Поручение",	Поручение);
	
	СтатусыИсполненияВФайловомШлюзе = Новый Массив;
	СтатусыИсполненияВФайловомШлюзе.Добавить(Перечисления.СтатусыДокументовФайловыйШлюз.Исполнено);
	СтатусыИсполненияВФайловомШлюзе.Добавить(Перечисления.СтатусыДокументовФайловыйШлюз.ИсполненоЧастично);
	Запрос.УстановитьПараметр("СтатусыИсполненияВФайловомШлюзе", СтатусыИсполненияВФайловомШлюзе);
	
	НачатьТранзакцию();
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	ЗафиксироватьТранзакцию();
	
	Возврат Новый Структура("ЗапросМаксимальноеКоличествоОтчета, ЗапросВходящийРегНомер, ЗапросРаспределенныеКоличества",
		РезультатыЗапроса[1], РезультатыЗапроса[3], РезультатыЗапроса[7]);
	
КонецФункции

Функция ДанныеВходящихПакетов(Номер, Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"//00//////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТехОперация.Ссылка КАК Документ,
	|	ТехОперация.РегистрационныйНомер КАК ВходящийРегНомер
	|ПОМЕСТИТЬ втТехОперации
	|ИЗ
	|	Документ.ТехническаяОперация КАК ТехОперация
	|ГДЕ
	|	ТехОперация.НомерДокументаОснования = &Номер
	|	И НАЧАЛОПЕРИОДА(ТехОперация.Дата, ГОД) = НАЧАЛОПЕРИОДА(&Дата, ГОД)
	|	И НЕ ТехОперация.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТехОперация.Дата УБЫВ
	|;
	|
	|//01//////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТехОперации.ВходящийРегНомер КАК ВходящийРегНомер
	|ИЗ
	|	втТехОперации КАК втТехОперации
	|;
	|
	|//02//////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ЗапросКоличество.КоличествоИсполнения), 0) КАК МаксимальноеКоличествоОтчета
	|ИЗ
	|	(ВЫБРАТЬ
	|		Состояния.КоличествоИсполнения КАК КоличествоИсполнения
	|	ИЗ
	|		РегистрСведений.СостоянияДокументовВФайловомШлюзе КАК Состояния
	|	ГДЕ
	|		Состояния.Статус В (&СтатусыИсполненияВФайловомШлюзе)
	|		И Состояния.Документ В
	|			(ВЫБРАТЬ
	|				втТехОперации.Документ
	|			ИЗ
	|				втТехОперации КАК втТехОперации)) КАК ЗапросКоличество
	|;
	|
	|//03//////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Состояния.Статус КАК Статус,
	|	Состояния.Комментарий КАК Комментарий,
	|	ВЫБОР
	|		КОГДА Состояния.Статус В (&СтатусыИсполненияВФайловомШлюзе)
	|			ТОГДА Состояния.Пакет.НомерВходящегоДокумента
	|		ИНАЧЕ Состояния.Документ.КодОтчетаНРД
	|	КОНЕЦ КАК КодОтчетаВышестоящегоДепозитария,
	|	ВЫБОР
	|		КОГДА Состояния.Статус В (&СтатусыИсполненияВФайловомШлюзе)
	|			ТОГДА Состояния.Пакет.ДатаВходящегоДокумента
	|		ИНАЧЕ Состояния.Документ.ДатаИсполнения
	|	КОНЕЦ КАК ДатаИсполнения,
	|	ЕСТЬNULL(Состояния.Пакет.Дата, ДАТАВРЕМЯ(1,1,1)) КАК ДатаПакета,
	|	Состояния.КоличествоИсполнения КАК ИсполненноеКоличество,
	|	Состояния.КоличествоИсполнения КАК КоличествоОтчета,
	|	"""" КАК НомерОтчетаОСовершеннойОперации,
	|	ДАТАВРЕМЯ(1,1,1) КАК ДатаОтчетаОСовершеннойОперации
	|ИЗ
	|	РегистрСведений.СостоянияДокументовВФайловомШлюзе КАК Состояния
	|ГДЕ
	|	Состояния.Документ В
	|		(ВЫБРАТЬ
	|			втТехОперации.Документ
	|		ИЗ
	|			втТехОперации КАК втТехОперации)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Состояния.Период
	|";
	Запрос.УстановитьПараметр("Номер",	Номер);
	Запрос.УстановитьПараметр("Дата",	Дата);

	СтатусыИсполненияВФайловомШлюзе = Новый Массив;
	СтатусыИсполненияВФайловомШлюзе.Добавить(Перечисления.СтатусыДокументовФайловыйШлюз.Исполнено);
	СтатусыИсполненияВФайловомШлюзе.Добавить(Перечисления.СтатусыДокументовФайловыйШлюз.ИсполненоЧастично);
	Запрос.УстановитьПараметр("СтатусыИсполненияВФайловомШлюзе", СтатусыИсполненияВФайловомШлюзе);
	
	НачатьТранзакцию();
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	ЗафиксироватьТранзакцию();
	
	Возврат Новый Структура("ЗапросВходящийРегНомер, ЗапросМаксимальноеКоличествоОтчета, ЗапросРаспределенныеКоличества",
		РезультатыЗапроса[1], РезультатыЗапроса[2], РезультатыЗапроса[3]);
	
КонецФункции

Функция ДанныеСтатусовПоручений(Поручение)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	"""" КАК ВходящийРегНомер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	""0"" КАК МаксимальноеКоличествоОтчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТехОперация.Ссылка КАК Документ
	|ПОМЕСТИТЬ втТехОперация
	|ИЗ
	|	Документ.ТехническаяОперация КАК ТехОперация
	|ГДЕ
	|	НЕ ТехОперация.ПометкаУдаления
	|	И ТехОперация.ДокументОснование = &Поручение
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТехОперация.Дата УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Состояния.Статус КАК Статус,
	|	Состояния.Комментарий КАК Комментарий,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Состояния.Пакет) = ТИП(Документ.ВходящийПакетИзФайловогоШлюза)
	|			ТОГДА ВЫРАЗИТЬ(Состояния.Пакет КАК Документ.ВходящийПакетИзФайловогоШлюза).НомерВходящегоДокумента
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КодОтчетаВышестоящегоДепозитария,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Состояния.Пакет) = ТИП(Документ.ВходящийПакетИзФайловогоШлюза)
	|			ТОГДА ВЫРАЗИТЬ(Состояния.Пакет КАК Документ.ВходящийПакетИзФайловогоШлюза).ДатаВходящегоДокумента
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ КАК ДатаИсполнения,
	|	ЕСТЬNULL(Состояния.Пакет.Дата, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПакета,
	|	0 КАК ИсполненноеКоличество,
	|	0 КАК КоличествоОтчета,
	|	"""" КАК НомерОтчетаОСовершеннойОперации,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаОтчетаОСовершеннойОперации
	|ИЗ
	|	РегистрСведений.СостоянияДокументовВФайловомШлюзе.СрезПоследних(
	|			,
	|			Документ В
	|				(ВЫБРАТЬ
	|					втТехОперация.Документ
	|				ИЗ
	|					втТехОперация КАК втТехОперация)) КАК Состояния
	|ГДЕ
	|	Состояния.Статус <> &Исполнено
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Исполнено,
	|	"""",
	|	ДокументПоручение.КодОтчетаНРД,
	|	ДокументПоручение.ДатаИсполненияПоручения,
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	0,
	|	0,
	|	"""",
	|	ДАТАВРЕМЯ(1, 1, 1)
	|ИЗ
	|	Документ.Поручение КАК ДокументПоручение
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыПорученийВСЭД.СрезПоследних КАК Документооборот
	|		ПО ДокументПоручение.Ссылка = Документооборот.Поручение
	|			И (Документооборот.Статус В (&СтатусыСЭД))
	|ГДЕ
	|	ДокументПоручение.Ссылка = &Поручение
	|	И ДокументПоручение.ДатаИсполненияПоручения <> ДАТАВРЕМЯ(1, 1, 1)";
	
	Запрос.УстановитьПараметр("Исполнено", Перечисления.СтатусыДокументовФайловыйШлюз.Исполнено);
	СтатусыСЭД = Новый Массив;
	СтатусыСЭД.Добавить(Перечисления.СтатусыДокументовВСЭД.Загружено);
	СтатусыСЭД.Добавить(Перечисления.СтатусыДокументовВСЭД.Подписано);
	Запрос.УстановитьПараметр("СтатусыСЭД", СтатусыСЭД);
	
	Запрос.УстановитьПараметр("Поручение", Поручение);
	
	НачатьТранзакцию();
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	ЗафиксироватьТранзакцию();
	
	Возврат Новый Структура("ЗапросВходящийРегНомер, ЗапросМаксимальноеКоличествоОтчета, ЗапросРаспределенныеКоличества",
	РезультатыЗапроса[0], РезультатыЗапроса[1], РезультатыЗапроса[3]);
	
КонецФункции

Процедура ОбработатьНеопределенныеЗначения(StatusMessage)
	
	Если StatusMessage.Status = Неопределено Тогда
		StatusMessage.Status = -1;
	КонецЕсли;
	
	Если StatusMessage.Description = Неопределено Тогда
		StatusMessage.Description = "";
	КонецЕсли;
	
	Если StatusMessage.reg_no = Неопределено Тогда
		StatusMessage.reg_no = "";
	КонецЕсли;
	
	Если StatusMessage.reg_date = Неопределено Тогда
		StatusMessage.reg_date = Дата(1,1,1);
	КонецЕсли;
	
КонецПроцедуры

Функция GetFunctionalElectronicDocumentsStatusMulti(DocumentHeader)
	СквознойИдентификаторВызова = DocumentHeader.CallId;
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьФайловыйШлюзДляОтправкиПоручений") Тогда 
		Возврат ОтветВебСервиса(СквознойИдентификаторВызова, -1, "Функциональная опция ""ИспользоватьФайловыйШлюзДляОтправкиПоручений"" выключена");
	КонецЕсли;
	
	RequestStatusType = ФабрикаXDTO.Тип("http://www.vtbcapital-broker.com/depo/FunctionalElectronicDocuments", "SendFunctionalElectronicDocumentsRequestStatusMultiType");
	FunctionalElectronicDocumentHeaderType = ФабрикаXDTO.Тип("http://www.vtbcapital-broker.com/depo/FunctionalElectronicDocuments", "FunctionalElectronicDocumentHeaderMultiType");
	FunctionalElectronicDocumentStatusMessageType = ФабрикаXDTO.Тип("http://www.vtbcapital-broker.com/depo/FunctionalElectronicDocuments", "FunctionalElectronicDocumentMultiStatusMessageType");
	
	RequestStatus = ФабрикаXDTO.Создать(RequestStatusType);
	FunctionalElectronicDocumentHeader = ФабрикаXDTO.Создать(FunctionalElectronicDocumentHeaderType);
	FunctionalElectronicDocumentStatusMessage = ФабрикаXDTO.Создать(FunctionalElectronicDocumentStatusMessageType);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номер", DocumentHeader.OrderId);
	Запрос.УстановитьПараметр("Количество", DocumentHeader.SeqAmo);
	Запрос.УстановитьПараметр("ЭлементКоличество", "SEQ_AMO");
	Запрос.УстановитьПараметр("СтатусИсполнено", Перечисления.СтатусыДокументовФайловыйШлюз.Исполнено);
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТехническаяОперация.Ссылка КАК Документ
	|ПОМЕСТИТЬ ВТ_ТехническиеОперации
	|ИЗ
	|	Документ.ТехническаяОперация КАК ТехническаяОперация
	|ГДЕ
	|	ТехническаяОперация.НомерДокументаОснования = &Номер
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТехническаяОперация.Дата УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТехническиеОперации.Документ КАК Документ,
	|	ВходящийПакетИзФайловогоШлюзаСодержимоеФайла.Ссылка КАК ВходящийПакет
	|ПОМЕСТИТЬ ВТ_ВходящиеПакетыФШ
	|ИЗ
	|	ВТ_ТехническиеОперации КАК ВТ_ТехническиеОперации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВходящийПакетИзФайловогоШлюза.СодержимоеФайла КАК ВходящийПакетИзФайловогоШлюзаСодержимоеФайла
	|		ПО (ВходящийПакетИзФайловогоШлюзаСодержимоеФайла.Ссылка.ДокументОснование = ВТ_ТехническиеОперации.Документ)
	|ГДЕ
	|	НЕ ВходящийПакетИзФайловогоШлюзаСодержимоеФайла.Ссылка ЕСТЬ NULL 
	|	И ВходящийПакетИзФайловогоШлюзаСодержимоеФайла.Значение = &Количество
	|	И ВходящийПакетИзФайловогоШлюзаСодержимоеФайла.Элемент = &ЭлементКоличество
	|	И ВходящийПакетИзФайловогоШлюзаСодержимоеФайла.Ссылка.Статус = &СтатусИсполнено
	|	И НЕ ВходящийПакетИзФайловогоШлюзаСодержимоеФайла.Ссылка.ОбработанMulti
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВТ_ВходящиеПакетыФШ.Документ КАК Документ,
	|	ВТ_ВходящиеПакетыФШ.ВходящийПакет КАК ВходящийПакет,
	|	TREG_DATE.Значение КАК TREG_DATE,
	|	REPORT_ID.Значение КАК REPORT_ID,
	|	REG_DATE.Значение КАК REG_DATE,
	|	REG_NO.Значение КАК РегистрационныйНомер,
	|	ВТ_ВходящиеПакетыФШ.ВходящийПакет.Статус КАК Статус
	|ИЗ
	|	ВТ_ВходящиеПакетыФШ КАК ВТ_ВходящиеПакетыФШ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВходящийПакетИзФайловогоШлюза.СодержимоеФайла КАК REG_DATE
	|		ПО ВТ_ВходящиеПакетыФШ.ВходящийПакет = REG_DATE.Ссылка
	|			И (REG_DATE.Элемент = ""REG_DATE"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВходящийПакетИзФайловогоШлюза.СодержимоеФайла КАК TREG_DATE
	|		ПО ВТ_ВходящиеПакетыФШ.ВходящийПакет = TREG_DATE.Ссылка
	|			И (TREG_DATE.Элемент = ""TREG_DATE"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВходящийПакетИзФайловогоШлюза.СодержимоеФайла КАК REPORT_ID
	|		ПО ВТ_ВходящиеПакетыФШ.ВходящийПакет = REPORT_ID.Ссылка
	|			И (REPORT_ID.Элемент = ""REPORT_ID"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВходящийПакетИзФайловогоШлюза.СодержимоеФайла КАК REG_NO
	|		ПО ВТ_ВходящиеПакетыФШ.ВходящийПакет = REG_NO.Ссылка
	|			И (REG_NO.Элемент = ""REG_NO"")
	|ГДЕ
	|	НЕ TREG_DATE.Ссылка ЕСТЬ NULL 
	|	И НЕ REPORT_ID.Ссылка ЕСТЬ NULL 
	|	И НЕ REG_DATE.Ссылка ЕСТЬ NULL 
	|	И НЕ REG_NO.Ссылка ЕСТЬ NULL 
	|
	|УПОРЯДОЧИТЬ ПО
	|	РегистрационныйНомер,
	|	REG_DATE,
	|	TREG_DATE,
	|	REPORT_ID";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		FunctionalElectronicDocumentStatusMessage.Status = СтатусЧислом(Выборка.Статус);
		FunctionalElectronicDocumentStatusMessage.Description = "";
		FunctionalElectronicDocumentStatusMessage.reg_no = Выборка.РегистрационныйНомер;
		FunctionalElectronicDocumentStatusMessage.ReportId = Выборка.REPORT_ID;
		ДатаРегистрации = Выборка.REG_DATE+Сред(Выборка.TREG_DATE,0,2)*3600+Сред(Выборка.TREG_DATE,4,2)*60+Сред(Выборка.TREG_DATE,7,2);
		FunctionalElectronicDocumentStatusMessage.reg_date = ДатаРегистрации;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(FunctionalElectronicDocumentHeader, DocumentHeader);
	Если FunctionalElectronicDocumentStatusMessage.reg_no = Неопределено Тогда
		FunctionalElectronicDocumentStatusMessage.reg_no = "";
	КонецЕсли; 
	Если FunctionalElectronicDocumentStatusMessage.reg_date = Неопределено Тогда
		FunctionalElectronicDocumentStatusMessage.reg_date = Дата(1,1,1);
	КонецЕсли; 
	Если FunctionalElectronicDocumentStatusMessage.Status = Неопределено Тогда
		FunctionalElectronicDocumentStatusMessage.Status = -1;
	КонецЕсли; 
	Если FunctionalElectronicDocumentStatusMessage.Description = Неопределено Тогда
		FunctionalElectronicDocumentStatusMessage.Description = "";
	КонецЕсли;
	Если FunctionalElectronicDocumentStatusMessage.ReportId = Неопределено Тогда
		FunctionalElectronicDocumentStatusMessage.ReportId = 0;
	КонецЕсли;
	
	RequestStatus.FunctionalElectronicDocumentHeader = FunctionalElectronicDocumentHeader;
	RequestStatus.FunctionalElectronicDocumentStatusMessage = FunctionalElectronicDocumentStatusMessage;
	
	Возврат RequestStatus;
КонецФункции

Функция SendConfirmMultiStatus(ReportId)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВходящийПакетИзФайловогоШлюзаСодержимоеФайла.Ссылка КАК Документ
	|ИЗ
	|	Документ.ВходящийПакетИзФайловогоШлюза.СодержимоеФайла КАК ВходящийПакетИзФайловогоШлюзаСодержимоеФайла
	|ГДЕ
	|	ВходящийПакетИзФайловогоШлюзаСодержимоеФайла.Значение = &ReportId
	|	И ВходящийПакетИзФайловогоШлюзаСодержимоеФайла.Элемент = ""REPORT_ID""";
	Запрос.УстановитьПараметр("ReportId", ReportId);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДокументВходящий = Выборка.Документ.ПолучитьОбъект();
		ДокументВходящий.ОбработанMulti = Истина;
		ДокументВходящий.Записать();
		Возврат "Успешно";
	Иначе
		Возврат "Не удалось найти входящий документ по ReportID";
	КонецЕсли;
	
КонецФункции

Функция GetNDCReports(Date1, Date2, OrderTypeId)
	СквознойИдентификаторВызова = Новый УникальныйИдентификатор;
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьФайловыйШлюзДляОтправкиПоручений") Тогда 
		Возврат "";//ОтветВебСервиса(СквознойИдентификаторВызова, 0, "Функциональная опция ""ИспользоватьФайловыйШлюзДляОтправкиПоручений"" выключена");
	КонецЕсли;	
	
	ВнешнийИсточникФайловыйШлюзКаталогКОтправке = ПланыВидовХарактеристик.ВнешниеИсточники.ФайловыйШлюзКаталогОбменИЦ;	
	ПутьДляВыгрузки = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ВнешнийИсточникФайловыйШлюзКаталогКОтправке).Папка;
	Если НЕ ЗначениеЗаполнено(ПутьДляВыгрузки) Тогда
		Возврат "";//ОтветВебСервиса(СквознойИдентификаторВызова, 0, "Не указан внешний источник ""ФайловыйШлюзКаталогОбменИЦ""");
	КонецЕсли;
	
	Папка = Новый Файл(ПутьДляВыгрузки);
	Если НЕ Папка.Существует() ИЛИ НЕ Папка.ЭтоКаталог() Тогда
		Возврат "";//ОтветВебСервиса(СквознойИдентификаторВызова, 0, "Каталог " + ПутьДляВыгрузки + " не существует");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата1", Date1);
	Запрос.УстановитьПараметр("Дата2", КонецДня(Date2));
	Запрос.УстановитьПараметр("КодОперации", OrderTypeId);
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВходящийПакетИзФайловогоШлюза.Ссылка КАК Ссылка,
	               |	ВходящийПакетИзФайловогоШлюза.ИмяФайла
	               |ИЗ
	               |	Документ.ТехническаяОперация КАК ТехническаяОперация
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВходящийПакетИзФайловогоШлюза.СодержимоеФайла КАК ВходящийПакетИзФайловогоШлюза
	               |		ПО (ВходящийПакетИзФайловогоШлюза.Ссылка.ДокументОснование = ТехническаяОперация.Ссылка)
	               |			И (ВходящийПакетИзФайловогоШлюза.Ссылка.Обработан = ЛОЖЬ)
	               |ГДЕ
	               |	ТехническаяОперация.ДатаДокументаОснования МЕЖДУ &дата1 И &дата2
	               |	И ТехническаяОперация.КодОперации = &КодОперации
	               |	И ТехническаяОперация.ПометкаУдаления = ЛОЖЬ
	               |ИТОГИ ПО
	               |	Ссылка";
				   
		
	КоличествоФайлов = 0;
	
	ВыборкаПакет = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПакет.Следующий() Цикл
		КоличествоФайлов = КоличествоФайлов + 1;
		
		ИмяФайлаАрхив = ПутьДляВыгрузки + "\" + ВыборкаПакет.Ссылка.ОтносительныйПуть + ".zip";	
		МассивФайловDBF = Новый Массив;
		
		СодержимоеФайла = ВыборкаПакет.Ссылка.СодержимоеФайла.Выгрузить();
		
		ВыборкаФайл = ВыборкаПакет.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаФайл.Следующий() Цикл
			МассивПолей = СодержимоеФайла.НайтиСтроки(Новый Структура("ИмяФайла, НомерСтрокиФайла", ВыборкаФайл.ИмяФайла, 1));
			Если МассивПолей.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли; 
			
			ИмяФайла = ПутьДляВыгрузки + "\" + ВыборкаФайл.ИмяФайла;
			
			НовыйФайл = Новый XBase;
			НовыйФайл.Кодировка = КодировкаXBase.OEM;
			//НовыйФайл.СоздатьФайл(ИмяФайла);
			//НовыйФайл.Записать();
			
			МассивПолей = СодержимоеФайла.НайтиСтроки(Новый Структура("ИмяФайла, НомерСтрокиФайла", ВыборкаФайл.ИмяФайла, 1));
			Для каждого Поле Из МассивПолей Цикл
				НовыйФайл.Поля.Добавить(Поле.Элемент, Поле.Тип, Поле.Длина);
			КонецЦикла; 
			
			НовыйФайл.СоздатьФайл(ИмяФайла);
			НовыйФайл.Записать();
			
			ТекНомерСтроки = 0;
			МассивПолей = СодержимоеФайла.НайтиСтроки(Новый Структура("ИмяФайла", ВыборкаФайл.ИмяФайла));
			Для каждого Поле Из МассивПолей Цикл
				Если ТекНомерСтроки <> Поле.НомерСтрокиФайла Тогда
					Если ТекНомерСтроки <> 0 Тогда
						НовыйФайл.Записать();
					КонецЕсли; 
					НовыйФайл.Добавить();
					ТекНомерСтроки = Поле.НомерСтрокиФайла
				КонецЕсли; 
				
				НовыйФайл[Поле.Элемент] = Поле.Значение;
				
			КонецЦикла; 
			
			НовыйФайл.Записать();
			НовыйФайл.ЗакрытьФайл();
			
			МассивФайловDBF.Добавить(ИмяФайла);
			
		КонецЦикла; 
		
		Архиватор = Новый ЗаписьZipФайла(ИмяФайлаАрхив);
		Для каждого ИмяФайла Из МассивФайловDBF Цикл
			Архиватор.Добавить(ИмяФайла);	
		КонецЦикла; 
		Архиватор.Записать();		
		
		Для каждого ИмяФайла Из МассивФайловDBF Цикл
			УдалитьФайлы(ИмяФайла);
		КонецЦикла;	
		
	КонецЦикла; 
	
	Возврат ПутьДляВыгрузки;//ОтветВебСервиса(СквознойИдентификаторВызова, КоличествоФайлов, ПутьДляВыгрузки);
КонецФункции

Функция СтатусЧислом(Статус)
	
	Коды = Новый Соответствие;
	Коды.Вставить(Перечисления.СтатусыДокументовФайловыйШлюз.ВыгруженоФайловыйШлюз,	0);
	Коды.Вставить(Перечисления.СтатусыДокументовФайловыйШлюз.ОшибкаФайловыйШлюз,	1);
	Коды.Вставить(Перечисления.СтатусыДокументовФайловыйШлюз.ВыгруженоВебКабинет,	2);
	Коды.Вставить(Перечисления.СтатусыДокументовФайловыйШлюз.ПринятоКИсполнению,	3);
	Коды.Вставить(Перечисления.СтатусыДокументовФайловыйШлюз.НеПринятоКИсполнению,	4);
	Коды.Вставить(Перечисления.СтатусыДокументовФайловыйШлюз.Исполнено,				5);
	Коды.Вставить(Перечисления.СтатусыДокументовФайловыйШлюз.НеИсполнено,			6);
	Коды.Вставить(Перечисления.СтатусыДокументовФайловыйШлюз.ИсполненоЧастично,		7);
	
	Коды.Вставить(Перечисления.СтатусыПоручений.Обрабатывается,						8);
	Коды.Вставить(Перечисления.СтатусыПоручений.Исполнено,							5);
	Коды.Вставить(Перечисления.СтатусыПоручений.ОтказаноВИсполнении,				9);
	Коды.Вставить(Перечисления.СтатусыПоручений.Другой,								10);
	Коды.Вставить(Перечисления.СтатусыПоручений.Отменено,							11);
	Коды.Вставить(Перечисления.СтатусыПоручений.ИсполненоЧастично,					7);
	
	Код = Коды[Статус];
	Если Код = Неопределено Тогда
		Код = -1;
	КонецЕсли;
	Возврат Код;
	
КонецФункции

Функция ОтветВебСервиса(CallId, StatusCode, Description)
	ResponceType = ФабрикаXDTO.Тип("http://www.vtbcapital-broker.com/depo/FunctionalElectronicDocuments", "SendFunctionalElectronicDocumentsResponceType");
	Responce = ФабрикаXDTO.Создать(ResponceType);
	BaseStatusType = ФабрикаXDTO.Тип("http://www.vtbcapital-broker.com/depo/FunctionalElectronicDocuments", "BaseStatusType");
	BaseStatus = ФабрикаXDTO.Создать(BaseStatusType);
	
	BaseStatus.StatusCode = StatusCode;
	BaseStatus.Description = Description;
	BaseStatus.CallId = CallId;
	Responce.BaseStatus = BaseStatus;
	
	Возврат Responce;
КонецФункции // ()

Функция СформироватьСтруктуруДокумента(Document, DocumentHeader)
	СтруктураВозврата = Новый Структура("ТекстДокумента, Ошибка");
	
	СоответствиеРеквизитовОбъекта = ОбщегоНазначения.ПолучитьСоответствиеРеквизитовОбъектаПоУмолчанию("Обработка.ЭкспортПорученийВЛуч", "Номера версий", , DocumentHeader.OrderDate);
	НомераВерсий = СоответствиеРеквизитовОбъекта["НомераВерсий"];
	
	Если НомераВерсий <> Неопределено Тогда
		НайденныеСтроки = НомераВерсий.НайтиСтроки(Новый Структура("КодОперации", Document.Order_Header.order_t_id));
		Если НайденныеСтроки.Количество() = 1 Тогда
			НомерВерсии = СокрЛП(НайденныеСтроки[0].НомерВерсии);
		Иначе
			СтруктураВозврата.Ошибка = "Не удалось определить номер версии для кода операции " + Document.Order_Header.order_t_id;
			СтруктураВозврата.ТекстДокумента = "";
			Возврат СтруктураВозврата;
		КонецЕсли;
	Иначе
		СтруктураВозврата.Ошибка = "Не найдены номера версий для эскпорта поручений в Луч";
		СтруктураВозврата.ТекстДокумента = "";
		Возврат СтруктураВозврата;
	КонецЕсли; 
	
	Запись = Новый ЗаписьXML;
	Запись.УстановитьСтроку("Windows-1251");
	Запись.ЗаписатьОбъявлениеXML();
	
	Запись.ЗаписатьНачалоЭлемента("Batch");
	ЗаписатьЭлементXML(Запись, "Documents_amount", "1");
	
	Запись.ЗаписатьНачалоЭлемента("Document");
	Запись.ЗаписатьАтрибут("DOC_ID"		, "1");
	Запись.ЗаписатьАтрибут("version"	, НомерВерсии);
	
	Для каждого Свойство Из Document.Свойства() Цикл
		Если Document[Свойство.Имя] <> Неопределено Тогда
			ЗаписатьБлокXML(Запись, Document[Свойство.Имя], Свойство.Имя);		
		КонецЕсли; 
	КонецЦикла; 
	//ЗаписатьБлокXML(Запись, Document.Order_Header, "ORDER_HEADER"); 
	//
	//OrderType = DocumentHeader.OrderType;
	//ЗаписатьБлокXML(Запись, Document[OrderType], OrderType);
	
	Запись.ЗаписатьКонецЭлемента(); //Document
	Запись.ЗаписатьКонецЭлемента(); //Batch
	
	СтруктураВозврата.Ошибка = "";
	СтруктураВозврата.ТекстДокумента = Запись.Закрыть();
	
	Возврат СтруктураВозврата;
КонецФункции // СформироватьСтруктуруДокумента()

Процедура ЗаписатьБлокXML(Запись, Источник, Имя)
	Запись.ЗаписатьНачалоЭлемента(Имя);
	Для каждого Свойство Из Источник.Свойства() Цикл
		Если Источник[Свойство.Имя] = Неопределено Тогда
			Продолжить;
		КонецЕсли; 
		Если ТипЗнч(Источник[Свойство.Имя]) = Тип("ОбъектXDTO") Тогда
			ЗаписатьБлокXML(Запись, Источник[Свойство.Имя], Свойство.Имя)
		ИначеЕсли ТипЗнч(Источник[Свойство.Имя]) = Тип("СписокXDTO") Тогда
			
			Для каждого ЭлементСписка Из Источник[Свойство.Имя] Цикл
				Запись.ЗаписатьНачалоЭлемента(Свойство.Имя);
				Для каждого СвойствоСписка Из ЭлементСписка.Свойства() Цикл
					Если ЭлементСписка[СвойствоСписка.Имя] = Неопределено Тогда
						Продолжить;
					КонецЕсли; 
					Если ТипЗнч(ЭлементСписка[СвойствоСписка.Имя]) = Тип("Дата") Тогда
						ЗаписатьЭлементXML(Запись, СвойствоСписка.Имя,  Формат(ЭлементСписка[СвойствоСписка.Имя], "ДФ=yyyy-MM-dd"));
					ИначеЕсли ТипЗнч(ЭлементСписка[СвойствоСписка.Имя]) = Тип("Число") Тогда
						ЗаписатьЭлементXML(Запись, СвойствоСписка.Имя,  Формат(ЭлементСписка[СвойствоСписка.Имя], "ЧРД=.; ЧГ=0"));	
					Иначе	
						ЗаписатьЭлементXML(Запись, СвойствоСписка.Имя,  ЭлементСписка[СвойствоСписка.Имя]);
					КонецЕсли;	
				КонецЦикла; 
				Запись.ЗаписатьКонецЭлемента();
			КонецЦикла; 
			
		ИначеЕсли ТипЗнч(Источник[Свойство.Имя]) = Тип("Дата") Тогда
			Если Свойство.Имя = "execute_dt" ИЛИ Свойство.Имя = "expirat_dt" Тогда
				ЗаписатьЭлементXML(Запись, Свойство.Имя, Формат(Источник[Свойство.Имя], "ДФ='yyyy-MM-dd ЧЧ:мм:сс'"));
			Иначе
				ЗаписатьЭлементXML(Запись, Свойство.Имя, Формат(Источник[Свойство.Имя], "ДФ=yyyy-MM-dd"));
			КонецЕсли; 
		ИначеЕсли ТипЗнч(Источник[Свойство.Имя]) = Тип("Число") Тогда
			ЗаписатьЭлементXML(Запись, Свойство.Имя, Формат(Источник[Свойство.Имя], "ЧРД=.; ЧГ=0"));
		Иначе
			Если Источник[Свойство.Имя] <> Неопределено Тогда
				ЗаписатьЭлементXML(Запись, Свойство.Имя, Источник[Свойство.Имя]);
			КонецЕсли;
		КонецЕсли; 
	КонецЦикла;
	Запись.ЗаписатьКонецЭлемента(); //Имя
КонецПроцедуры

Функция XDTOСтрокой(ОбъектXDTO)
	ЗаписьXML = Новый ЗаписьXML;
    ЗаписьXML.УстановитьСтроку("Windows-1251");
    ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОбъектXDTO);
	
    Возврат ЗаписьXML.Закрыть();
КонецФункции // XDTOСтрокой()
 
Процедура ЗаписатьЭлементXML(ЗаписьXML, Тег, Значение)
	ЗаписьXML.ЗаписатьНачалоЭлемента(Строка(Тег));						// Начало элемента
	//ЗаписьXML.ЗаписатьТекст(СтрЗаменить(Строка(Значение), " ", ""));	// Значение элемента
	ЗаписьXML.ЗаписатьТекст(СокрЛП(Строка(Значение)));				    // Значение элемента
	ЗаписьXML.ЗаписатьКонецЭлемента();									// Конец элемента
КонецПроцедуры
